DataProcessors/АРМПриемВозвратныхСчетФактурДИСПЕТЧЕРОМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АРМПриемВозвратныхСчетФактурДИСПЕТЧЕРОМ</Name>
			<Comment>Прием возвратных счет фактур ДИСПЕТЧЕРОМ</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ВозвратнаяСчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВозвратнаяСчетФактура</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВоздушка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетфактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отгрузка</Name>
					<Comment>ПереданоНаОтгрузку(Документ передан В Общую Базу Отрузки)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диспетчер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДВПриемаДиспетчером</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтаршийВодитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДВПриемаСтаршимВодителем</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатано</Name>
					<Comment>Счет Фактуры Распечатаны</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДВПриемаВодителем</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/АРМПриемВозвратныхСчетФактурДИСПЕТЧЕРОМ/Forms/Форма21112013/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	      
	
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		ШК = Лев(Данные, СтрДлина(Данные) - 1);	
		 Если ЗначениеЗаполнено(ШК) Тогда
			 //Поиск Возвратной СчетФ
			 ШКПриИзменении(Элементы.ШК); 			  
		 КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция  НайтиДокументПоШК(ШК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратнаяСчетФактура.Ссылка
		|ИЗ
		|	Документ.ВозвратнаяСчетФактура КАК ВозвратнаяСчетФактура
		|ГДЕ
		|	ВозвратнаяСчетФактура.ШК = &ШК
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВозвратнаяСчетФактура.Дата УБЫВ";

	Запрос.УстановитьПараметр("ШК", ШК);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат  ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	

КонецФункции

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
     ШКПриИзмененииСЕРВЕР();
 КонецПроцедуры
		  
&НаСервере
Процедура ШКПриИзмененииСЕРВЕР()
	//ШКДок = Лев(ШК, СтрДлина(ШК) - 1);
	ШКДок = ШК;
	Док=НайтиДокументПоШК(ШКДок);
			  Если ЗначениеЗаполнено(Док) Тогда
				 //Документ Найден
				
				 //Приемка диспетчером только если есть на месте отгрузки
				 проверкаОстатков=модСерверПолныеПрава.ПроверитьОстаткиПоКлиенту(Док.Получатель);
				 Если проверкаОстатков<>Неопределено Тогда
					 Если ЗначениеЗаполнено(Док.ДВПриемаДиспетчером) Тогда
						 Сообщить("Документ СФ - "+Док.НомерСчетфактуры + " уже принят ДИСПЕТЧЕРОМ.");	 
					 Иначе	 
						 ДокОбъект=Док.ПолучитьОбъект();
						 ДокОбъект.ДВПриемаДиспетчером=ТекущаяДата();
						 ДокОбъект.Диспетчер=ИмяПользователя();
						 ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
						 Сообщить("УСПЕШНО. Документ найден СФ - "+Док.НомерСчетфактуры + " и принят ДИСПЕТЧЕРОМ");
					 КонецЕсли;
				 Иначе
					Сообщить("ОТКАЗАНО! Нет Клиентов в зоне отгрузки.");
				 КонецЕсли;
			 
			 Иначе
				 Сообщить("ОШИБКА! Документ не найден.");
			  КонецЕсли;

			  Элементы.ВозвратныеСФнеПринятыеДиспетчером.Обновить();
			  Элементы.ВозвратныеСФПринятыеДиспетчером.Обновить();
			  Элементы.ВозвратныеСФПринятыеСТАРШИМВОДИТЕЛЕМ.Обновить();
			  
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтметкуТекущейСтроки()
			//Элементы.ВозвратныеСФнеПринятыеДиспетчером.ТекущаяСтрока=-1;
			//  Элементы.ВозвратныеСФПринятыеДиспетчером.ТекущаяСтрока=-1;
			//  Элементы.ВозвратныеСФПринятыеСТАРШИМВОДИТЕЛЕМ.ТекущаяСтрока=-1;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УбратьОтметкуТекущейСтроки();
КонецПроцедуры
